html/docker/kubernates-handbook/theory/cluster/namespace.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Namespace</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="node.html"> UP </a>
 |
 <a accesskey="H" href="cluster.html"> HOME </a>
</div><div id="content">
<h1 class="title">Namespace</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3a204e9">场景</a></li>
<li><a href="#orgfc14b86">使用</a></li>
</ul>
</div>
</div>
<p>
在一个 Kubernetes 集群中可以使用 namespace 创建多个 <span class="underline">虚拟集群</span> ，这些 namespace 之间可以完全隔离，也可以通过某种方式，让一个 namespace 中的 service 可以访问到其他的 namespace 中的服务
</p>

<pre class="example" id="org57d8221">
在 CentOS 中部署 kubernetes1.6 集群 的时候就用到了好几个跨越 namespace 的服务

比如 Traefik ingress 和 kube-systemnamespace 下的 service 就可以为整个集群提供服务，这些都需要通过 RBAC 定义集群级别的角色来实现
</pre>
<div id="outline-container-org3a204e9" class="outline-2">
<h2 id="org3a204e9">场景</h2>
<div class="outline-text-2" id="text-org3a204e9">
<p>
因为 namespace 可以提供独立的命名空间，因此可以实现部分的环境隔离
</p>

<pre class="example" id="orgd070596">
当项目和人员众多的时候可以考虑根据项目属性，例如生产、测试、开发划分不同的 namespace
</pre>
</div>
</div>
<div id="outline-container-orgfc14b86" class="outline-2">
<h2 id="orgfc14b86">使用</h2>
<div class="outline-text-2" id="text-orgfc14b86">
<p>
获取集群中有哪些 namespace：
</p>
<div class="org-src-container">
<pre class="src src-sh">$<span style="color: #4eee94;">kubectl</span> get ns
</pre>
</div>

<pre class="example" id="orge7c7e26">
集群中默认会有 default 和 kube-system 这两个 namespace
</pre>

<p>
在执行 kubectl 命令时可以使用 <span class="underline">-n</span> 指定操作的 namespace
</p>

<pre class="example" id="org53f6cc2">
用户的普通应用默认是在 default 下

与集群管理相关的为整个集群提供服务的应用一般部署在 kube-system 的 namespace 下，例如在安装 kubernetes 集群时部署的 kubedns、heapseter、EFK 等都是在这个 namespace 下面
</pre>
<p>
另外，并不是所有的资源对象都会对应 namespace
</p>

<pre class="example" id="org4b9ec05">
node 和 persistentVolume 就不属于任何 namespace
</pre>


<p>
<a href="label.html">Next：Label</a>
</p>

<p>
<a href="node.html">Previous：Node</a>
</p>

<p>
<a href="cluster.html">Home：Cluster</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
